// Задача 8: Напишите программу, которая на вход принимает число (N),
// а на выходе показывает все чётные числа от 1 до N
int N = 14;

int i = 0;
int b = 0;
while (i < N)
{
    i = i + 1;
    b = i % 2;
    if (b > 0)
    {

    }
    else
{
   Console.WriteLine(i);
}
}